CSI API ETABS v1
cDetailing.GetOneDetailedSlab_OneDetailingOutput_OneStrip_OneDetailingRegion_OneBottomRebar_Bar2Info Method
 Represents one Bar in extent - BOTTOM BAR2
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetOneDetailedSlab_OneDetailingOutput_OneStrip_OneDetailingRegion_OneBottomRebar_Bar2Info(
	int DetailingOutputIndex,
	int StripIndex,
	int DetailingRegionIndex,
	int BottomRebarIndex,
	ref string GUID,
	ref string PlaceCode,
	ref double Dia,
	ref string Size,
	ref int Number,
	ref double StartDist,
	ref double EndDist,
	ref int StartBend,
	ref int EndBend,
	ref string Material
)
Function GetOneDetailedSlab_OneDetailingOutput_OneStrip_OneDetailingRegion_OneBottomRebar_Bar2Info (
	DetailingOutputIndex As Integer,
	StripIndex As Integer,
	DetailingRegionIndex As Integer,
	BottomRebarIndex As Integer,
	ByRef GUID As String,
	ByRef PlaceCode As String,
	ByRef Dia As Double,
	ByRef Size As String,
	ByRef Number As Integer,
	ByRef StartDist As Double,
	ByRef EndDist As Double,
	ByRef StartBend As Integer,
	ByRef EndBend As Integer,
	ByRef Material As String
) As Integer
Dim instance As cDetailing
Dim DetailingOutputIndex As Integer
Dim StripIndex As Integer
Dim DetailingRegionIndex As Integer
Dim BottomRebarIndex As Integer
Dim GUID As String
Dim PlaceCode As String
Dim Dia As Double
Dim Size As String
Dim Number As Integer
Dim StartDist As Double
Dim EndDist As Double
Dim StartBend As Integer
Dim EndBend As Integer
Dim Material As String
Dim returnValue As Integer
returnValue = instance.GetOneDetailedSlab_OneDetailingOutput_OneStrip_OneDetailingRegion_OneBottomRebar_Bar2Info(DetailingOutputIndex,
	StripIndex, DetailingRegionIndex,
	BottomRebarIndex, GUID, PlaceCode,
	Dia, Size, Number, StartDist, EndDist,
	StartBend, EndBend, Material)
int GetOneDetailedSlab_OneDetailingOutput_OneStrip_OneDetailingRegion_OneBottomRebar_Bar2Info(
	int DetailingOutputIndex,
	int StripIndex,
	int DetailingRegionIndex,
	int BottomRebarIndex,
	String^% GUID,
	String^% PlaceCode,
	double% Dia,
	String^% Size,
	int% Number,
	double% StartDist,
	double% EndDist,
	int% StartBend,
	int% EndBend,
	String^% Material
)
abstract GetOneDetailedSlab_OneDetailingOutput_OneStrip_OneDetailingRegion_OneBottomRebar_Bar2Info :
        DetailingOutputIndex : int *
        StripIndex : int *
        DetailingRegionIndex : int *
        BottomRebarIndex : int *
        GUID : string byref *
        PlaceCode : string byref *
        Dia : float byref *
        Size : string byref *
        Number : int byref *
        StartDist : float byref *
        EndDist : float byref *
        StartBend : int byref *
        EndBend : int byref *
        Material : string byref -> int
Parameters
DetailingOutputIndex
Type: System.Int32
 Detailing Output Index
StripIndex
Type: System.Int32
 Strip Index
DetailingRegionIndex
Type: System.Int32
 Detailing region index
BottomRebarIndex
Type: System.Int32
 Bottom rebar index
GUID
Type: System.String
 GUID assigned by CSiDetail
PlaceCode
Type: System.String
 Place Code. A = Top Long Bar in Exterior Span. B = Top Short Bar in Exterior Span. C = Top Long Bar in Interior Span. D = Top Short Bar in Interior Span. E = Bottom Long Bar in Interior/Exterior Span. F = Bottom Short Bar in Interior/Exterior Span
Dia
Type: System.Double
 Diameter of Bar
Size
Type: System.String
 Bar Designation, based on seleeted Rebar Set
Number
Type: System.Int32
 Total number of Bars of this type
StartDist
Type: System.Double
 Start Location of the Bar, along X in local axis of region
EndDist
Type: System.Double
 End Location of the Bar, along X in local axis of region
StartBend
Type: System.Int32
 Bend type at start of bar
EndBend
Type: System.Int32
 Bend type at end of of bar
Material
Type: System.String
 Material assigned to Slab
Return Value
Type: Int32
Returns zero if the function is successful; otherwise it returns a nonzero value.
See Also
Reference
cDetailing Interface
ETABSv1 Namespace